Median,Quantile, Percentile,Mode,IQR

Median used in Datascience-used in handling missing values(data cleaning)



Quantiles and percentiles are crucial statistical concepts that assist in understanding and interpreting data
IQR(Interquartile Range)-range between the 25th percentile and the 75th percentile

In [17]:
import pandas as pd
import numpy as np

calculating quantiles

In [20]:
import numpy as np

#quantiles
data = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])
quartiles = np.quantile(data, [0.25, 0.5, 0.75])
print(f"1st Quartile (Q1): {quartiles[0]}")
print(f"2nd Quartile (Q2)/Median: {quartiles[1]}")
print(f"3rd Quartile (Q3): {quartiles[2]}")

1st Quartile (Q1): 32.5
2nd Quartile (Q2)/Median: 55.0
3rd Quartile (Q3): 77.5

Percentiles divide a dataset into 100 equal parts. The nth percentile represents the value below which npercent of the data falls. For instance, the 50th percentile (also known as the median) is the value below which 50% of the data lies.

In [22]:
#Calculating Percentiles
percentiles = np.percentile(data, [10, 20, 30, 40, 50, 60, 70, 80, 90, 100])
print(f"25th Percentile: {percentiles[0]}")
print(f"50th Percentile/Median: {percentiles[1]}")
print(f"75th Percentile: {percentiles[2]}")

25th Percentile: 19.0
50th Percentile/Median: 28.0
75th Percentile: 37.0

Interquartile range is calculated by using the difference between the third Quartile Q3 and the first Quartile Q1. Interquartile range is used to calculate the difference between the upper and lower quartiles in the set of give data. Interquartile range is mostlyuseful measure of variability for skewed distributions.IQR is the range between the first and the third quartiles namely Q1 and Q3: IQR = Q3 â€“ Q1.

In [26]:
#Interquartile Range( (IQR))


# Example dataset
data = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100,10000,35555])

# Calculate Q1, Q3, and IQR
Q1 = np.percentile(data, 25)
Q3 = np.percentile(data, 75)
IQR = Q3 - Q1

# Define lower and upper bounds for potential outliers
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

# Identify potential outliers
outliers = (data < lower_bound) | (data > upper_bound)

print("Lower Bound:", lower_bound)
print("Upper Bound:", upper_bound)
print("Potential Outliers:", data[outliers])

Lower Bound: -45.0
Upper Bound: 175.0
Potential Outliers: [10000 35555]

calculating mode

In [19]:
import numpy as np
from scipy import stats

data = np.array([2, 3, 4, 4, 6, 7, 8, 8, 8, 9])
mode_result = stats.mode(data)

print("Mode:", mode_result.mode)

Mode: 8

In [ ]:
df = pd.read_csv("income.csv", names=["name","income"], skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [ ]:
df.income.describe()

count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07
Name: income, dtype: float64

In [ ]:
#numpy library
df.income.quantile(0)

4000.0

In [ ]:
df.income.quantile(0.25,interpolation="higher")

6000

In [ ]:
df.income.quantile(0.5,interpolation="higher")

7000

In [ ]:
df.income.quantile(0.75)

7750.0

In [ ]:
df.income.quantile(1)

10000000.0

In [ ]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

In [ ]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [ ]:
df['income'][3]=np.NaN

C:\Users\USER\AppData\Local\Temp\ipykernel_10860\3054271026.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.NaN

In [ ]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [ ]:
df.income.mean()

1671666.6666666667

In [ ]:
df_new = df.fillna(df.income.mean())
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [ ]:
df_new = df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0